ciaa/firmware_v1/externals/drivers/msp430/inc/msp430p325.h
#define TPCTL_                0x004B    /* Timer/Port Control */
sfrb(TPCTL, TPCTL_);
#define EN1FG               (0x01)
#define RC1FG               (0x02)
#define RC2FG               (0x04)
#define EN1                 (0x08)
#define ENA                 (0x10)
#define ENB                 (0x20)
#define TPSSEL0             (0x40)
#define TPSSEL1             (0x80)
/* The EN1 signal of TPCNT1 is coded with with Bits 3-5 in TPCTL */
#define TPCNT1_EN_OFF        (0x00)                  /* TPCNT1 is disabled */
#define TPCNT1_EN_ON         (ENA)                   /*   "    is enabled */
#define TPCNT1_EN_nTPIN5     (ENB)                   /*   "    is enabled with ~TPIN.5 */
#define TPCNT1_EN_TPIN5      (TPSSEL0+ENB)           /*   "    is enabled with TPIN.5 */
#define TPCNT1_EN_nCIN       (ENB+ENA)               /*   "    is enabled with ~CIN */
#define TPCNT1_EN_CIN        (TPSSEL0+ENB+ENA)       /*   "    is enabled with CIN */

/* Source select of clock input coded with Bits 6-7 in TPCTL */
#define TPSSEL_CLK1_CIN     (0x00)                   /* CLK1 source is signal at CIN   (default) */
#define TPSSEL_CLK1_ACLK    (TPSSEL0)                /* CLK1 source is ACLK */
#define TPSSEL_CLK1_MCLK    (TPSSEL1)                /* CLK1 source is MCLK */

/* DATA REGISTER ADDRESSES */
#define TPCNT1_               0x004C    /* Timer/Port Counter 1 */
sfrb(TPCNT1, TPCNT1_);
#define TPCNT2_               0x004D    /* Timer/Port Counter 2 */
sfrb(TPCNT2, TPCNT2_);

#define TPD_                  0x004E    /* Timer/Port Data */
sfrb(TPD, TPD_);
#define TPD_0               (0x01)
#define TPD_1               (0x02)
#define TPD_2               (0x04)
#define TPD_3               (0x08)
#define TPD_4               (0x10)
#define TPD_5               (0x20)
#define CPON                (0x40)
#define B16                 (0x80)

#define TPE_                  0x004F    /* Timer/Port Enable */
sfrb(TPE, TPE_);
#define TPE_0               (0x01)
#define TPE_1               (0x02)
#define TPE_2               (0x04)
#define TPE_3               (0x08)
#define TPE_4               (0x10)
#define TPE_5               (0x20)
#define TPSSEL2             (0x40)
#define TPSSEL3             (0x80)
/* Source select of clock input coded with Bits 6-7 in TPE
   NOTE: If the control bit B16 in TPD is set, TPSSEL2/3
         are 'don't care' and the clock source of counter
         TPCNT2 is the same as of the counter TPCNT1. */
#define TPSSEL_CLK2_TPIN5   (0x00)           /* CLK2 source is signal TPIN.5 (default) */
#define TPSSEL_CLK2_ACLK    (TPSSEL2)        /* CLK2 source is ACLK */
#define TPSSEL_CLK2_MCLK    (TPSSEL3)        /* CLK2 source is MCLK */
#define TPSSEL_CLK2_OFF     (TPSSEL3+TPSSEL2)/* CLK2 source is disabled  */

/************************************************************
* A/D CONVERTER 12 + 2
************************************************************/
#define __MSP430_HAS_ADC14__          /* Definition to show that Module is available */

#define AIN_                  0x0110    /* ADC Input */
const_sfrw(AIN, AIN_);
#define AEN_                  0x0112    /* ADC Input Enable */
sfrw(AEN, AEN_);

#define ACTL_                 0x0114    /* ADC Control */
sfrw(ACTL, ACTL_);
/* the names of the mode bits are different from the spec */
#define ADSOC               (0x0001)
#define ADSVCC              (0x0002)
#define ADIN0               (0x0004)
#define ADIN1               (0x0008)
#define ADIN2               (0x0010)
#define ADINOFF             (0x0020)
#define ADCSRC0             (0x0040)
#define ADCSRC1             (0x0080)
#define ADCSRCOFF           (0x0100)
#define ADRNG0              (0x0200)
#define ADRNG1              (0x0400)
#define ADAUTO              (0x0800)
#define ADPD                (0x1000)
/* Channel select coded with Bits 2-5 */
#define ADIN_A0             (0x0000)                  /* (default) */
#define ADIN_A1             (ADIN0)
#define ADIN_A2             (ADIN1)
#define ADIN_A3             (ADIN1+ADIN0)
#define ADIN_A4             (ADIN2)
#define ADIN_A5             (ADIN2+ADIN0)
#define ADIN_A6             (ADIN2+ADIN1)
#define ADIN_A7             (ADIN2+ADIN1+ADIN0)
/* Current source output select coded with Bits 6-8 */
#define ADCSRC_A0           (0x0000)                  /* (default) */
#define ADCSRC_A1           (ADCSRC0)
#define ADCSRC_A2           (ADCSRC1)
#define ADCSRC_A3           (ADCSRC1+ADCSRC0)
/* Range select coded with Bits 9-11 */
#define ADRNG_A             (0x0000)                  /* 0<=Vin<1/4Vref  (default) */
#define ADRNG_B             (ADRNG0)                  /* 1/4 Vref<=Vin<1/2 Vref */
#define ADRNG_C             (ADRNG1)                  /* 1/2 Vref<=Vin<3/4 Vref */
#define ADRNG_D             (ADRNG1+ADRNG0)           /* 3/4 Vref<=Vin<1   Vref */
#define ADRNG_AUTO          (ADAUTO)                  /* 0<=Vin<1   Vref auto detect range */

/* DATA REGISTER ADDRESS */
#define ADAT_                 0x0118    /* ADC Data */
const_sfrw(ADAT, ADAT_);

/************************************************************
* EPROM CONTROL
************************************************************/
#define __MSP430_HAS_EPROM__          /* Definition to show that Module is available */

#define EPCTL_                0x0054    /* EPROM Control */
sfrb(EPCTL, EPCTL_);
#define EPEXE               (0x01)
#define EPVPPS              (0x02)

/************************************************************
* Interrupt Vectors (offset from 0xFFE0)
************************************************************/

#define PORT0_VECTOR            ( 1)                     /* 0xFFE0 Port 0 Bits 2-7 [Lowest Priority] */
#define BASICTIMER_VECTOR       ( 2)                     /* 0xFFE2 Basic Timer */
#define TIMERPORT_VECTOR        ( 5)                     /* 0xFFE8 Timer/Port */
#define ADC_VECTOR              ( 6)                     /* 0xFFEA ADC */
#define WDT_VECTOR              (11)                     /* 0xFFF4 Watchdog Timer */
#define IO1_VECTOR              (13)                     /* 0xFFF8 Dedicated IO (P0.1) */
#define IO0_VECTOR              (14)                     /* 0xFFFA Dedicated IO (P0.0) */
#define NMI_VECTOR              (15)                     /* 0xFFFC Non-maskable */
#define RESET_VECTOR            ("reset")                /* 0xFFFE Reset [Highest Priority] */

/************************************************************
* End of Modules
************************************************************/
#ifdef __cplusplus
}
#endif /* extern "C" */

#endif /* #ifndef __msp430x32x */

